# 1- Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Дополнительно: можете проверить, что это действительно число, и что это действительно входит в нужный диапазон
# Пример:
#     6 -> да
#     7 -> да
#     1 -> нет

day = input('Введите число, обозначающее день недели от 1 до 7: ')
if day == '6' and '7':
    print('Ура, выходные!')
else:
    print('Опять на работу')
